In [1]:
import pandas as pd
import os
import glob

In [2]:
# glob only show that files which is ends with .xlsx name
files=glob.glob('data/*.xlsx')
files

['data\\Sales_Feb.xlsx', 'data\\Sales_Jan.xlsx', 'data\\Sales_Mar.xlsx']

In [3]:
# now merge all months in one dataframe
df_list=[pd.read_excel(f) for f in files]
df=pd.concat(df_list,ignore_index=True)
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,NaN,Meena,Banglore,upi,NaN
1,01/02/2024,2002,tshirt,clothes,499.0,2.0,armaan,delhi,UPI,998.0
2,2024/02/02,2003,Shoes,FootWear,1299.0,1.0,Sneha,bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,card,597.0
4,2024.02.03,2005,jeans,clothes,899.0,1.0,Rahul,Mumbai,Cash,800.0

In [4]:
df.drop_duplicates(inplace=True)
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,NaN,Meena,Banglore,upi,NaN
1,01/02/2024,2002,tshirt,clothes,499.0,2.0,armaan,delhi,UPI,998.0
2,2024/02/02,2003,Shoes,FootWear,1299.0,1.0,Sneha,bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,card,597.0
4,2024.02.03,2005,jeans,clothes,899.0,1.0,Rahul,Mumbai,Cash,800.0

In [5]:
df.isna().sum()

Date            0
Order_ID        0
Product         0
Category        0
Unit_Price      1
Quantity        3
Customer        0
City            0
Payment_Mode    0
Total           5
dtype: int64

In [6]:
df.duplicated().sum()

np.int64(0)

In [7]:
df['City']=df['City'].str.strip().str.title()
df['City'].unique()

array(['Banglore', 'Delhi', 'Bangalore', 'Mumbai'], dtype=object)

In [8]:
df['Date']=df['Date'].fillna('2025-01-01')
df

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,NaN,Meena,Banglore,upi,NaN
1,01/02/2024,2002,tshirt,clothes,499.0,2.0,armaan,Delhi,UPI,998.0
2,2024/02/02,2003,Shoes,FootWear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,card,597.0
4,2024.02.03,2005,jeans,clothes,899.0,1.0,Rahul,Mumbai,Cash,800.0
5,04/02/2024,2006,Kurta,Clothes,699.0,1.0,Meena,Banglore,card,699.0
6,05-02-2024,2007,T-Shirt,CLOTHES,499.0,2.0,ArMAN,Delhi,cash,900.0
7,2024/01/02,1001,tshirt,clothes,499.0,2.0,armaan,Delhi,upi,1200.0
8,02-01-2024,1001,tshirt,Cloths,499.0,2.0,Armaan,Delhi,UPI,1200.0
9,1 Jan 2024,1002,Jeans,Clothes,899.0,1.0,RAHUL,Mumbai,Cash,899.0
10,2024.01.05,1003,Shoes,Footwear,1299.0,NaN,Sneha,Bangalore,card,NaN
11,05/01/24,1004,kurta,CLOTHES,699.0,2.0,meena,Bangalore,UPI,1400.0
12,06-01-2024,1005,Phone Case,accessory,199.0,3.0,Rohan,Delhi,upi,NaN
13,2024/01/07,1006,jeans,clothes,899.0,1.0,rahul,Mumbai,Card,899.0
14,08-01-24,1007,TShirt,Cloths,499.0,1.0,ArMAN,Delhi,cash,499.0
15,2024/03/01,3001,shoes,footwear,1299.0,1.0,Sneha,Bangalore,upi,1299.0
16,01-03-24,3002,Jeans,clothes,899.0,NaN,rahul,Mumbai,cash,NaN
17,2024.03.02,3003,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
18,03 Mar 2024,3004,T-Shirt,Clothes,499.0,1.0,Armaan,Delhi,UPI,500.0
19,2024/03/04,3005,Kurta,Clothes,NaN,2.0,Meena,Banglore,Card,NaN
20,04-03-2024,3006,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,cash,1299.0
21,2024/03/05,3007,Jeans,clothes,899.0,1.0,Rahul,Mumbai,card,899.0

In [9]:
df.isna().sum()

Date            0
Order_ID        0
Product         0
Category        0
Unit_Price      1
Quantity        3
Customer        0
City            0
Payment_Mode    0
Total           5
dtype: int64

In [10]:
# to check which row with the nan value?
df[df['Unit_Price'].isna()]
# df['Unit-Price']=df['Unit_Price'].fillna(df['Unit_Price'].mean())

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
19,2024/03/04,3005,Kurta,Clothes,NaN,2.0,Meena,Banglore,Card,NaN

In [11]:
df['Product']=df['Product'].str.strip().str.title()
df['Category']=df['Category'].str.strip().str.title()
df['Customer']=df['Customer'].str.strip().str.title()
df['Payment_Mode']=df['Payment_Mode'].str.strip().str.title()
df['Quantity']=df['Quantity'].bfill()
df['Total']=df['Total'].bfill()


df

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,2.0,Meena,Banglore,Upi,998.0
1,01/02/2024,2002,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024/02/02,2003,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024.02.03,2005,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,800.0
5,04/02/2024,2006,Kurta,Clothes,699.0,1.0,Meena,Banglore,Card,699.0
6,05-02-2024,2007,T-Shirt,Clothes,499.0,2.0,Arman,Delhi,Cash,900.0
7,2024/01/02,1001,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,1200.0
8,02-01-2024,1001,Tshirt,Cloths,499.0,2.0,Armaan,Delhi,Upi,1200.0
9,1 Jan 2024,1002,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0
10,2024.01.05,1003,Shoes,Footwear,1299.0,2.0,Sneha,Bangalore,Card,1400.0
11,05/01/24,1004,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1400.0
12,06-01-2024,1005,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Upi,899.0
13,2024/01/07,1006,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0
14,08-01-24,1007,Tshirt,Cloths,499.0,1.0,Arman,Delhi,Cash,499.0
15,2024/03/01,3001,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Upi,1299.0
16,01-03-24,3002,Jeans,Clothes,899.0,3.0,Rahul,Mumbai,Cash,597.0
17,2024.03.02,3003,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
18,03 Mar 2024,3004,T-Shirt,Clothes,499.0,1.0,Armaan,Delhi,Upi,500.0
19,2024/03/04,3005,Kurta,Clothes,NaN,2.0,Meena,Banglore,Card,1299.0
20,04-03-2024,3006,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Cash,1299.0
21,2024/03/05,3007,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0

In [12]:
df.isna().sum()

Date            0
Order_ID        0
Product         0
Category        0
Unit_Price      1
Quantity        0
Customer        0
City            0
Payment_Mode    0
Total           0
dtype: int64

In [13]:
df['Category']=df['Category'].replace({'Cloths':'Clothes'})
df['Product'] = df['Product'].str.replace("-", "").str.title()
df['Customer']=df['Customer'].replace({'Arman':'Armaan'})
df['City']=df['City'].replace({'Banglore':'Bangalore'})
df

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,998.0
1,01/02/2024,2002,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024/02/02,2003,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024.02.03,2005,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,800.0
5,04/02/2024,2006,Kurta,Clothes,699.0,1.0,Meena,Bangalore,Card,699.0
6,05-02-2024,2007,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Cash,900.0
7,2024/01/02,1001,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,1200.0
8,02-01-2024,1001,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,1200.0
9,1 Jan 2024,1002,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0
10,2024.01.05,1003,Shoes,Footwear,1299.0,2.0,Sneha,Bangalore,Card,1400.0
11,05/01/24,1004,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1400.0
12,06-01-2024,1005,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Upi,899.0
13,2024/01/07,1006,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0
14,08-01-24,1007,Tshirt,Clothes,499.0,1.0,Armaan,Delhi,Cash,499.0
15,2024/03/01,3001,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Upi,1299.0
16,01-03-24,3002,Jeans,Clothes,899.0,3.0,Rahul,Mumbai,Cash,597.0
17,2024.03.02,3003,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
18,03 Mar 2024,3004,Tshirt,Clothes,499.0,1.0,Armaan,Delhi,Upi,500.0
19,2024/03/04,3005,Kurta,Clothes,NaN,2.0,Meena,Bangalore,Card,1299.0
20,04-03-2024,3006,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Cash,1299.0
21,2024/03/05,3007,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0

In [14]:
df=df.drop_duplicates(subset=['Order_ID'],keep='first')
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,998.0
1,01/02/2024,2002,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024/02/02,2003,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024.02.03,2005,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,800.0

In [15]:
df=df.drop(df.columns[-1],axis=1)
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode
0,2024-02-01,2001,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi
1,01/02/2024,2002,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi
2,2024/02/02,2003,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card
4,2024.02.03,2005,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash

In [16]:
df['Total']=df['Unit_Price']*df['Quantity']
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
1,01/02/2024,2002,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024/02/02,2003,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,03-02-24,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024.02.03,2005,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0

In [17]:
df['Date']=pd.to_datetime(df['Date'],errors='coerce',dayfirst=True,format='mixed')

In [18]:
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2001,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
1,2024-02-01,2002,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024-02-02,2003,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,2024-02-03,2004,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024-02-03,2005,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0

In [19]:
# Reset Order_ID to be sequential
df['Order_ID'] = range(2004, 2004 + len(df))
df.head()

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2004,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
1,2024-02-01,2005,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024-02-02,2006,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,2024-02-03,2007,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024-02-03,2008,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0

In [20]:
df['Unit_Price'] = df['Unit_Price'].ffill()
df['Total']=df['Total'].ffill()

In [21]:
df

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2004,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
1,2024-02-01,2005,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024-02-02,2006,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,2024-02-03,2007,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024-02-03,2008,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0
5,2024-02-04,2009,Kurta,Clothes,699.0,1.0,Meena,Bangalore,Card,699.0
6,2024-02-05,2010,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Cash,998.0
7,2024-01-02,2011,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
9,2024-01-01,2012,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0
10,2024-01-05,2013,Shoes,Footwear,1299.0,2.0,Sneha,Bangalore,Card,2598.0
11,2024-01-05,2014,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
12,2024-01-06,2015,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Upi,597.0
13,2024-01-07,2016,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0
14,2024-01-08,2017,Tshirt,Clothes,499.0,1.0,Armaan,Delhi,Cash,499.0
15,2024-03-01,2018,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Upi,1299.0
16,2024-03-01,2019,Jeans,Clothes,899.0,3.0,Rahul,Mumbai,Cash,2697.0
17,2024-03-02,2020,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
18,2024-03-03,2021,Tshirt,Clothes,499.0,1.0,Armaan,Delhi,Upi,499.0
19,2024-03-04,2022,Kurta,Clothes,499.0,2.0,Meena,Bangalore,Card,499.0
20,2024-03-04,2023,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Cash,1299.0
21,2024-03-05,2024,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0

In [22]:
df['Total']=df['Unit_Price']*df['Quantity']
df

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
0,2024-02-01,2004,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
1,2024-02-01,2005,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
2,2024-02-02,2006,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Card,1299.0
3,2024-02-03,2007,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
4,2024-02-03,2008,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0
5,2024-02-04,2009,Kurta,Clothes,699.0,1.0,Meena,Bangalore,Card,699.0
6,2024-02-05,2010,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Cash,998.0
7,2024-01-02,2011,Tshirt,Clothes,499.0,2.0,Armaan,Delhi,Upi,998.0
9,2024-01-01,2012,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Cash,899.0
10,2024-01-05,2013,Shoes,Footwear,1299.0,2.0,Sneha,Bangalore,Card,2598.0
11,2024-01-05,2014,Kurta,Clothes,699.0,2.0,Meena,Bangalore,Upi,1398.0
12,2024-01-06,2015,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Upi,597.0
13,2024-01-07,2016,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0
14,2024-01-08,2017,Tshirt,Clothes,499.0,1.0,Armaan,Delhi,Cash,499.0
15,2024-03-01,2018,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Upi,1299.0
16,2024-03-01,2019,Jeans,Clothes,899.0,3.0,Rahul,Mumbai,Cash,2697.0
17,2024-03-02,2020,Phone Case,Accessory,199.0,3.0,Rohan,Delhi,Card,597.0
18,2024-03-03,2021,Tshirt,Clothes,499.0,1.0,Armaan,Delhi,Upi,499.0
19,2024-03-04,2022,Kurta,Clothes,499.0,2.0,Meena,Bangalore,Card,998.0
20,2024-03-04,2023,Shoes,Footwear,1299.0,1.0,Sneha,Bangalore,Cash,1299.0
21,2024-03-05,2024,Jeans,Clothes,899.0,1.0,Rahul,Mumbai,Card,899.0

In [23]:
df.isna().sum()

Date            0
Order_ID        0
Product         0
Category        0
Unit_Price      0
Quantity        0
Customer        0
City            0
Payment_Mode    0
Total           0
dtype: int64

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 0 to 21
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          21 non-null     datetime64[ns]
 1   Order_ID      21 non-null     int64
 2   Product       21 non-null     object
 3   Category      21 non-null     object
 4   Unit_Price    21 non-null     float64
 5   Quantity      21 non-null     float64
 6   Customer      21 non-null     object
 7   City          21 non-null     object
 8   Payment_Mode  21 non-null     object
 9   Total         21 non-null     float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 1.8+ KB

In [25]:
df.describe(include='all')

,Date,Order_ID,Product,Category,Unit_Price,Quantity,Customer,City,Payment_Mode,Total
count,21,21.000000,21,21,21.000000,21.000000,21,21,21,21.000000
unique,NaN,NaN,5,3,NaN,NaN,5,3,3,NaN
top,NaN,NaN,Tshirt,Clothes,NaN,NaN,Armaan,Bangalore,Card,NaN
freq,NaN,NaN,5,14,NaN,NaN,5,8,8,NaN
mean,2024-02-02 19:25:42.857142784,2014.000000,NaN,NaN,732.333333,1.714286,NaN,NaN,NaN,1098.285714
min,2024-01-01 00:00:00,2004.000000,NaN,NaN,199.000000,1.000000,NaN,NaN,NaN,499.000000
25%,2024-01-07 00:00:00,2009.000000,NaN,NaN,499.000000,1.000000,NaN,NaN,NaN,699.000000
50%,2024-02-03 00:00:00,2014.000000,NaN,NaN,699.000000,2.000000,NaN,NaN,NaN,998.000000
75%,2024-03-01 00:00:00,2019.000000,NaN,NaN,899.000000,2.000000,NaN,NaN,NaN,1299.000000
max,2024-03-05 00:00:00,2024.000000,NaN,NaN,1299.000000,3.000000,NaN,NaN,NaN,2697.000000
std,NaN,6.204837,NaN,NaN,361.017082,0.783764,NaN,NaN,NaN,588.906287

In [26]:
df.columns

Index(['Date', 'Order_ID', 'Product', 'Category', 'Unit_Price', 'Quantity',
       'Customer', 'City', 'Payment_Mode', 'Total'],
      dtype='object')

In [27]:
total_revenue = df['Total'].sum()
total_quantity = df['Quantity'].sum()
unique_customers = df['Customer'].nunique()
unique_products = df['Product'].nunique()

print("\n=== BASIC BUSINESS METRICS ===")
print(f"Total Revenue: {total_revenue}")
print(f"Total Quantity Sold: {total_quantity}")
print(f"Unique Customers: {unique_customers}")
print(f"Unique Products: {unique_products}")

=== BASIC BUSINESS METRICS ===
Total Revenue: 23064.0
Total Quantity Sold: 36.0
Unique Customers: 5
Unique Products: 5

In [28]:
print("\n=== SALES BY CITY ===")

city_sales=df.groupby('City')['Total'].sum().sort_values(ascending=False)
print(city_sales)

=== SALES BY CITY ===
City
Bangalore    10988.0
Mumbai        6293.0
Delhi         5783.0
Name: Total, dtype: float64

In [29]:
print('\n===SALES BY CATEGORY===')
category_sales=df.groupby('Category')['Total'].sum().sort_values(ascending=False)
category_sales

===SALES BY CATEGORY===

Category
Clothes      14778.0
Footwear      6495.0
Accessory     1791.0
Name: Total, dtype: float64

In [30]:
print('\n===CUSTOMERS EXPENSES & BEST(TOP) CUSTOMER===')
coustomer_expense=df.groupby('Customer')['Total'].sum().sort_values(ascending=False)
coustomer_expense

===CUSTOMERS EXPENSES & BEST(TOP) CUSTOMER===

Customer
Sneha     6495.0
Rahul     6293.0
Meena     4493.0
Armaan    3992.0
Rohan     1791.0
Name: Total, dtype: float64

In [31]:
print('\n===BEST SELLING PRODUCT==')
best_sales=df.groupby('Product')['Quantity'].sum().sort_values(ascending=False)
best_sales

===BEST SELLING PRODUCT==

Product
Phone Case    9.0
Tshirt        8.0
Jeans         7.0
Kurta         7.0
Shoes         5.0
Name: Quantity, dtype: float64

In [32]:
print('\n===REVENUE BY PRODUCT==')
best_sales=df.groupby('Product')['Total'].sum().sort_values(ascending=False)
best_sales

===REVENUE BY PRODUCT==

Product
Shoes         6495.0
Jeans         6293.0
Kurta         4493.0
Tshirt        3992.0
Phone Case    1791.0
Name: Total, dtype: float64

In [33]:
print('\n ===SALES BY PAYMENT_MODE===')
payment_mode=df.groupby('Payment_Mode')['Total'].sum().sort_values(ascending=False)
payment_mode

 ===SALES BY PAYMENT_MODE===

Payment_Mode
Card    8586.0
Cash    7291.0
Upi     7187.0
Name: Total, dtype: float64

In [34]:

df['Month']=df['Date'].dt.month
print('\n===monthly sales analysis===')
month_sales=df.groupby('Month')['Total'].sum()
month_sales

===monthly sales analysis===

Month
1    7888.0
2    6888.0
3    8288.0
Name: Total, dtype: float64

In [35]:
print('\n===Daily sales===')
daily_sales=df.groupby('Date')['Total'].sum()
daily_sales

===Daily sales===

Date
2024-01-01     899.0
2024-01-02     998.0
2024-01-05    3996.0
2024-01-06     597.0
2024-01-07     899.0
2024-01-08     499.0
2024-02-01    2396.0
2024-02-02    1299.0
2024-02-03    1496.0
2024-02-04     699.0
2024-02-05     998.0
2024-03-01    3996.0
2024-03-02     597.0
2024-03-03     499.0
2024-03-04    2297.0
2024-03-05     899.0
Name: Total, dtype: float64

In [36]:
pivot=pd.pivot_table(df,values='Total',index='Category',columns='City',aggfunc='sum',fill_value=0)
print('\n===SALES PIVOT TABLE===')
pivot

===SALES PIVOT TABLE===

City       Bangalore   Delhi  Mumbai
Category
Accessory        0.0  1791.0     0.0
Clothes       4493.0  3992.0  6293.0
Footwear      6495.0     0.0     0.0